
{
"Bad Ending": "A narrative conclusion often resulting in tragedy or dissatisfaction for the audience.",
"Neutral Ending": "A story conclusion that neither fully satisfies nor completely disappoints, leaving some plot points unresolved and open to interpretation.",
"Happy Ending": "A narrative conclusion where the protagonist achieves their goals, resolving conflicts and providing a sense of joy and fulfillment.",
"Aggressive": "Someone confronts challenges with hostility and force, often disregarding others' feelings.",
"Manipulative": "Someone influences others to their advantage through deceit or indirect tactics.",
"Reckless": "Someone acts without considering the consequences, often endangering themselves or others.",
"Tyrannical": "Someone exercises power in a cruel or oppressive manner, demanding absolute obedience.",
"Overbearing": "Someone insists on controlling situations, often overwhelming those around them.",
"Emotionally Suppressed": "Someone avoids expressing their true feelings, keeping emotions tightly controlled.",
"Indecisive": "Someone struggles to make choices, often wavering between options without commitment.",
"Gossiping": "Someone shares others' private matters or rumors, often leading to misunderstandings.",
"Over-Emotional": "Someone reacts intensely to situations, allowing feelings to override logic.",
"Self-Sacrificing": "Someone prioritizes others' needs over their own, sometimes to their detriment.",
"Neglectful": "Someone fails to care for responsibilities or the well-being of others.",
"Caring": "Someone shows genuine concern and kindness towards others.",
"Empathetic": "Someone understands and shares the feelings of another, offering compassion.",
"Supportive": "Someone provides encouragement and assistance, helping others succeed.",
"Resilient": "Someone recovers quickly from difficulties, maintaining strength and determination.",
"Intuitive": "Someone understands situations instinctively, without the need for conscious reasoning.",
"Strategic Thinking": "Someone plans carefully to achieve long-term objectives, considering various outcomes.",
"Leadership": "Someone guides and inspires others towards achieving common goals.",
"Assertiveness": "Someone expresses their opinions confidently while respecting others.",
"Guardian": "Someone protects and defends others, ensuring their safety and well-being.",
"Mentorship": "Someone advises and supports others in their personal or professional development.",
"Logic": "Someone approaches problems with reason and structured thinking, avoiding emotional bias.",
"Obligation": "Someone acts out of a sense of duty or commitment, fulfilling responsibilities.",
"Sensitivity": "Someone is aware of and responsive to the feelings of others, showing tact and care.",
"Communication": "Someone conveys ideas and information effectively, facilitating understanding."
}